{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-Name",
    "2": "I-Name",
    "3": "B-Title",
    "4": "I-Title",
    "5": "B-Role",
    "6": "I-Role",
    "7": "B-Contact",
    "8": "I-Contact",
    "9": "B-Email",
    "10": "I-Email",
    "11": "B-Qualifications",
    "12": "I-Qualifications",
    "13": "B-Experience",
    "14": "I-Experience",
    "15": "B-Skills",
    "16": "I-Skills",
    "17": "B-Company",
    "18": "I-Company"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-Company": 17,
    "B-Contact": 7,
    "B-Email": 9,
    "B-Experience": 13,
    "B-Name": 1,
    "B-Qualifications": 11,
    "B-Role": 5,
    "B-Skills": 15,
    "B-Title": 3,
    "I-Company": 18,
    "I-Contact": 8,
    "I-Email": 10,
    "I-Experience": 14,
    "I-Name": 2,
    "I-Qualifications": 12,
    "I-Role": 6,
    "I-Skills": 16,
    "I-Title": 4,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
